In [1]:
import numpy as np
import pandas as pd

In [2]:
ser  = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [3]:
data = [{"a" : i, "b" : 2*i} for i in range(3)]

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   a  b
0  0  0
1  1  2
2  2  4

In [6]:
ser.loc["b"]

2

In [7]:
ser.iloc[1]

2

In [8]:
area = pd.Series({"California" : 423967, "Texas" : 695662,
                    "New York" : 141297, "Florida" : 170312,
                    "Illinois" : 149995})
population = pd.Series({"California" : 38332521, "Texas" : 26448193,
                        "New York" : 19651127, "Florida" : 19552860,
                        "Illinois" : 12882135})
data = pd.DataFrame({"area":area, "population":population})
print(data)

              area  population
California  423967    38332521
Texas       695662    26448193
New York    141297    19651127
Florida     170312    19552860
Illinois    149995    12882135

In [9]:
data.loc["California", "population"]

38332521

In [10]:
data.loc["California", :"population"]

area            423967
population    38332521
Name: California, dtype: int64

In [11]:
def make_df(cols, ind):
    """
    Cr√©e rapidement des DataFrame
    """
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

In [12]:
make_df("ABC", range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [13]:
df1 = make_df("AB", [1, 2])

In [14]:
df2 = make_df("AB", [3, 4])

In [15]:
df1

    A   B
1  A1  B1
2  A2  B2

In [16]:
df2

    A   B
3  A3  B3
4  A4  B4

In [17]:
pd.concat([df1, df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [18]:
df3 = pd.DataFrame({
    "employee": ["Bob", "Jake", "Lisa", "Sue"],
    "department": ["Accounting", "Engineering", "Engineering", "HR"]
})
df4 = pd.DataFrame({
    "date": [2004, 2008, 2012, 2014],
    "employee": ["Lisa", "Bob", "Jake", "Sue"]
})

In [19]:
df5 = pd.merge(df3, df4)

In [20]:
df5

  employee   department  date
0      Bob   Accounting  2008
1     Jake  Engineering  2012
2     Lisa  Engineering  2004
3      Sue           HR  2014

In [21]:
df6 = pd.concat([df3, df4])
df6

  employee   department    date
0      Bob   Accounting     NaN
1     Jake  Engineering     NaN
2     Lisa  Engineering     NaN
3      Sue           HR     NaN
0     Lisa          NaN  2004.0
1      Bob          NaN  2008.0
2     Jake          NaN  2012.0
3      Sue          NaN  2014.0

In [22]:
df7 = pd.DataFrame({
    "department": ["Accounting", "Engineering", "HR"],
    "supervisor": ["Carly", "Guido", "Steve"]
})

In [23]:
pd.merge(df5, df7)

  employee   department  date supervisor
0      Bob   Accounting  2008      Carly
1     Jake  Engineering  2012      Guido
2     Lisa  Engineering  2004      Guido
3      Sue           HR  2014      Steve

In [24]:
df8 = pd.DataFrame({
    "department": ["Accounting", "Accounting", "Engineering", "Engineering", "HR", "HR"],
    "competence": ["math", "spreadsheets", "coding", "linux", "spreadsheets", "organization"]
})

In [25]:
pd.merge(df3, df8)

  employee   department    competence
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [26]:
new_df = pd.DataFrame({
    "key": ["A", "B", "C", "A", "B", "C"],
    "data": range(6)}, columns=["key", "data"]
)
print(new_df)

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [29]:
new_df.groupby("key").sum()

     data
key
A       3
B       5
C       7

In [30]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index  # Rend les index identiques
# Nous avons alors des index dupliqu√©s
print(pd.concat([x, y]))

# Nous pouvons sp√©cifier des index hi√©rarchiques
hdf = pd.concat([x, y], keys=['x', 'y'])
print(hdf)

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [38]:
df_name1 = pd.DataFrame({
                        "employee": ['Bob', 'Jake', 'Lisa', 'Sue'],
                        'department': ['Accounting', 'Engineering', 'Engineering', 'HR']
})
df2_name = pd.DataFrame({
                        "emp_name": ['Lisa', 'Bob', 'Jake', 'Sue'],
                        'date': [2004, 2008, 2012, 2014]
})
df3_name = pd.merge(df1, df2)

df3_namev1 = pd.merge(df_name1, df2_name, left_on= "employee", right_on= "emp_name")
print(df3_name)
print(df3_namev1)

Empty DataFrame
Columns: [A, B]
Index: []
  employee   department emp_name  date
0      Bob   Accounting      Bob  2008
1     Jake  Engineering     Jake  2012
2     Lisa  Engineering     Lisa  2004
3      Sue           HR      Sue  2014

In [39]:
#Cardinalidad uno a uno
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'date': [2004, 2008, 2012, 2014]})

df3 = pd.merge(df1, df2)
df3

  employee   department  date
0      Bob   Accounting  2008
1     Jake  Engineering  2012
2     Lisa  Engineering  2004
3      Sue           HR  2014

In [40]:
#Cardinalidad uno a muchos (o muchos a uno)
df4 = pd.DataFrame({'department': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
pd.merge(df3, df4)

  employee   department  date supervisor
0      Bob   Accounting  2008      Carly
1     Jake  Engineering  2012      Guido
2     Lisa  Engineering  2004      Guido
3      Sue           HR  2014      Steve

In [42]:
#Cardinalidad de muchos a muchos
df5 = pd.DataFrame({'department': ['Accounting', 'Accounting', 'Engineering', 'Engineering', 'HR', 'HR'],
                    'competence': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})
pd.merge(df1, df5)

  employee   department    competence
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [49]:
#union externa
df6 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue', 'Lea'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR', 'Engineering']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue', 'Samir'],
                    'date': [2004, 2008, 2012, 2014, 2021]})
pd.merge(df6, df2)

  employee   department  date
0      Bob   Accounting  2008
1     Jake  Engineering  2012
2     Lisa  Engineering  2004
3      Sue           HR  2014

In [50]:
#left join
pd.merge(df6, df2, how="left")

  employee   department    date
0      Bob   Accounting  2008.0
1     Jake  Engineering  2012.0
2     Lisa  Engineering  2004.0
3      Sue           HR  2014.0
4      Lea  Engineering     NaN

In [51]:
#right join
pd.merge(df6, df2, how="right")

  employee   department  date
0     Lisa  Engineering  2004
1      Bob   Accounting  2008
2     Jake  Engineering  2012
3      Sue           HR  2014
4    Samir          NaN  2021

In [52]:
#outer join
pd.merge(df6, df2, how="outer")

  employee   department    date
0      Bob   Accounting  2008.0
1     Jake  Engineering  2012.0
2     Lisa  Engineering  2004.0
3      Sue           HR  2014.0
4      Lea  Engineering     NaN
5    Samir          NaN  2021.0

In [53]:
# Nous ajoutons une nouvelle colonne √† df1 et df2, qui contient toujours
# la m√™me valeur, ici 0.
df1['key'] = 0
df2['key'] = 0

# La jointure plusieurs-√†-plusieurs
produit_cartesien = pd.merge(df1, df2, on='key')

# Effa√ßons la colonne key qui n'est plus utile
produit_cartesien.drop('key',1, inplace=True)

In [54]:
pd.merge(df1.assign(key=0), df2.assign(key=0), on='key').drop('key', axis=1)

   employee_x   department employee_y  date
0         Bob   Accounting       Lisa  2004
1         Bob   Accounting        Bob  2008
2         Bob   Accounting       Jake  2012
3         Bob   Accounting        Sue  2014
4         Bob   Accounting      Samir  2021
5        Jake  Engineering       Lisa  2004
6        Jake  Engineering        Bob  2008
7        Jake  Engineering       Jake  2012
8        Jake  Engineering        Sue  2014
9        Jake  Engineering      Samir  2021
10       Lisa  Engineering       Lisa  2004
11       Lisa  Engineering        Bob  2008
12       Lisa  Engineering       Jake  2012
13       Lisa  Engineering        Sue  2014
14       Lisa  Engineering      Samir  2021
15        Sue           HR       Lisa  2004
16        Sue           HR        Bob  2008
17        Sue           HR       Jake  2012
18        Sue           HR        Sue  2014
19        Sue           HR      Samir  2021

In [55]:
#agregaci√≥n
rng = np.random.RandomState(42)

# Une Series avec cinq nombres al√©atoires
ser = pd.Series(rng.rand(5))
print(ser.sum())
print(ser.mean())

2.811925491708157
0.5623850983416314

In [56]:
df = pd.DataFrame({'A': rng.rand(5),
                   'B': rng.rand(5)})
                   
# Par colonne
print(df.mean())

# Par ligne
print(df.mean(axis='columns'))

A    0.477888
B    0.443420
dtype: float64
0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64